spec/fixtures/payments.xml

<IntuitResponse xmlns="http://schema.intuit.com/finance/v3" time="2013-11-15T15:25:09.985-08:00">
	<QueryResponse startPosition="0" maxResults="1" totalCount="1">
		<Payment domain="QBO" sparse="false">
			<Id>1</Id>
			<SyncToken>0</SyncToken>
			<MetaData>
				<CreateTime>2013-11-15T15:22:43-08:00</CreateTime>
				<LastUpdatedTime>2013-11-15T15:22:43-08:00</LastUpdatedTime>
			</MetaData>
			<DocNumber>1001</DocNumber>
			<TxnDate>2013-11-15</TxnDate>
			<CurrencyRef name="United States Dollar">USD</CurrencyRef>
			<PrivateNote>Statement Memo</PrivateNote>
			<Line>
				<Id>1</Id>
				<LineNum>1</LineNum>
				<Description>Plush Baby Doll</Description>
				<Amount>50.00</Amount>
				<DetailType>SalesItemLineDetail</DetailType>
				<SalesItemLineDetail>
					<ItemRef name="Sales">1</ItemRef>
					<UnitPrice>50</UnitPrice>
					<Qty>1</Qty>
					<TaxCodeRef>NON</TaxCodeRef>
				</SalesItemLineDetail>
			</Line>
			<Line>
				<Amount>50.00</Amount>
				<DetailType>SubTotalLineDetail</DetailType>
				<SubTotalLineDetail />
			</Line>
			<CustomerRef name="Sunset Bakery">2</CustomerRef>
			<TotalAmt>50.00</TotalAmt>
		</Payment>
	</QueryResponse>
</IntuitResponse>